<!-- dflook/terraform-github-actions {"workspace":"default","backend_type":"gcs","backend":"7ec2f078ba714304d919a3add962e9a45b99f9718e549b9ee99b90b81bc914b2","plan_job_ref":"Job Terraform Plan #19 at https://github.com/cal-itp/cal-bc/actions/runs/18598978862","plan_out_hash":"406a2c4155f68e664e7837fd8c970ac1d92be4036cc5e78a8ad839dc45320fa9","plan_hash":"0b81c0a20c739193208d3d510f881876425efd523b3510becbd8aeabba736370","plan_text_format":"diff","version":"2.2.2"} -->
Terraform plan in __iac/__
<details>
<summary>Plan: 6 to add, 0 to change, 0 to destroy.</summary>

```diff
Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
+   create

Terraform will perform the following actions:

  # google_sql_database.cal-bc-staging will be created
+   resource "google_sql_database" "cal-bc-staging" {
+       charset         = (known after apply)
+       collation       = (known after apply)
+       deletion_policy = "DELETE"
+       id              = (known after apply)
+       instance        = "cal-bc-staging"
+       name            = "cal-bc-staging"
+       project         = "cal-itp-data-infra-staging"
+       self_link       = (known after apply)
    }

  # google_sql_database_instance.cal-bc-staging will be created
+   resource "google_sql_database_instance" "cal-bc-staging" {
+       available_maintenance_versions = (known after apply)
+       connection_name                = (known after apply)
+       database_version               = "POSTGRES_14"
+       deletion_protection            = true
+       dns_name                       = (known after apply)
+       dns_names                      = (known after apply)
+       encryption_key_name            = (known after apply)
+       first_ip_address               = (known after apply)
+       id                             = (known after apply)
+       instance_type                  = (known after apply)
+       ip_address                     = (known after apply)
+       maintenance_version            = (known after apply)
+       master_instance_name           = (known after apply)
+       name                           = "cal-bc-staging"
+       private_ip_address             = (known after apply)
+       project                        = "cal-itp-data-infra-staging"
+       psc_service_attachment_link    = (known after apply)
+       public_ip_address              = (known after apply)
+       region                         = "us-west2"
+       replica_names                  = (known after apply)
+       self_link                      = (known after apply)
+       server_ca_cert                 = (sensitive value)
+       service_account_email_address  = (known after apply)

+       replica_configuration (known after apply)

+       replication_cluster (known after apply)

+       settings {
+           activation_policy     = "ALWAYS"
+           availability_type     = "ZONAL"
+           connector_enforcement = (known after apply)
+           disk_autoresize       = true
+           disk_autoresize_limit = 0
+           disk_size             = (known after apply)
+           disk_type             = (known after apply)
+           edition               = (known after apply)
+           pricing_plan          = "PER_USE"
+           tier                  = "db-f1-micro"
+           user_labels           = (known after apply)
+           version               = (known after apply)

+           backup_configuration (known after apply)

+           connection_pool_config (known after apply)

+           data_cache_config (known after apply)

+           insights_config (known after apply)

+           ip_configuration (known after apply)

+           location_preference (known after apply)
        }
    }

  # google_sql_user.cal-bc-staging will be created
+   resource "google_sql_user" "cal-bc-staging" {
+       host                    = (known after apply)
+       id                      = (known after apply)
+       instance                = "cal-bc-staging"
+       name                    = "cal-bc-staging"
+       password_wo             = (write-only attribute)
+       project                 = "cal-itp-data-infra-staging"
+       sql_server_user_details = (known after apply)
    }

  # random_password.cal-bc-staging-database will be created
+   resource "random_password" "cal-bc-staging-database" {
+       bcrypt_hash = (sensitive value)
+       id          = (known after apply)
+       length      = 32
+       lower       = true
+       min_lower   = 0
+       min_numeric = 0
+       min_special = 0
+       min_upper   = 0
+       number      = true
+       numeric     = true
+       result      = (sensitive value)
+       special     = false
+       upper       = true
    }

  # random_password.cal-bc-staging-secret-key will be created
+   resource "random_password" "cal-bc-staging-secret-key" {
+       bcrypt_hash = (sensitive value)
+       id          = (known after apply)
+       length      = 50
+       lower       = true
+       min_lower   = 0
+       min_numeric = 0
+       min_special = 0
+       min_upper   = 0
+       number      = true
+       numeric     = true
+       result      = (sensitive value)
+       special     = false
+       upper       = true
    }

  # module.cloud-run.google_cloud_run_service.main will be created
+   resource "google_cloud_run_service" "main" {
+       autogenerate_revision_name = true
+       id                         = (known after apply)
+       location                   = "us-west2"
+       name                       = "cal-bc-staging"
+       project                    = "cal-itp-data-infra-staging"
+       status                     = (known after apply)

+       metadata {
+           annotations           = {
+               "run.googleapis.com/ingress" = "all"
            }
+           effective_annotations = {
+               "run.googleapis.com/ingress" = "all"
            }
+           effective_labels      = {
+               "goog-terraform-provisioned" = "true"
            }
+           generation            = 0
+           namespace             = (known after apply)
+           resource_version      = (known after apply)
+           self_link             = (known after apply)
+           terraform_labels      = {
+               "goog-terraform-provisioned" = "true"
            }
+           uid                   = (known after apply)
        }

+       template {
+           metadata {
+               annotations      = {
+                   "autoscaling.knative.dev/maxScale" = "2"
+                   "autoscaling.knative.dev/minScale" = "1"
+                   "generated-by"                     = "terraform"
+                   "run.googleapis.com/client-name"   = "terraform"
                }
+               generation       = (known after apply)
+               labels           = (known after apply)
+               name             = (known after apply)
+               namespace        = (known after apply)
+               resource_version = (known after apply)
+               self_link        = (known after apply)
+               uid              = (known after apply)
            }
+           spec {
+               container_concurrency = (known after apply)
+               service_account_name  = "composer-service-account@cal-itp-data-infra-staging.iam.gserviceaccount.com"
+               serving_state         = (known after apply)
+               timeout_seconds       = 120

+               containers {
+                   args    = []
+                   command = []
+                   image   = "ghcr.io/cal-itp/cal-bc/cal-bc:development"
+                   name    = (known after apply)

+                   env {
                      # At least one attribute in this block is (or was) sensitive,
                      # so its contents will not be displayed.
                    }
+                   env {
                      # At least one attribute in this block is (or was) sensitive,
                      # so its contents will not be displayed.
                    }

+                   ports {
+                       container_port = 8080
+                       name           = "http1"
                    }

+                   resources {
+                       limits = (known after apply)
                    }

+                   startup_probe (known after apply)
                }
            }
        }

+       traffic {
+           latest_revision = true
+           percent         = 100
+           url             = (known after apply)
        }
    }

Plan: 6 to add, 0 to change, 0 to destroy.
```
</details>

:memo: Plan generated in [Terraform Plan #19](https://github.com/cal-itp/cal-bc/actions/runs/18598978862)